# Case Study #05 - ANOVA
    XYZ Company has offices in four different zones. The company wishes to investigate the following :
        ● The mean sales generated by each zone.
        ● Total sales generated by all the zones for each month.
        ● Check whether all the zones generate the same amount of sales.
    Help the company to carry out their study with the help of data provided.

In [21]:
import numpy as np
import pandas as pd
import scipy.stats as stats
from scipy.stats import f_oneway

In [22]:
#reading the data_set
data = pd.read_csv('Sales_data_zone_wise.csv')
data.head()

       Month  Zone - A  Zone - B  Zone - C  Zone - D
0  Month - 1   1483525   1748451   1523308   2267260
1  Month - 2   1238428   1707421   2212113   1994341
2  Month - 3   1860771   2091194   1282374   1241600
3  Month - 4   1871571   1759617   2290580   2252681
4  Month - 5   1244922   1606010   1818334   1326062

In [23]:
#performing primary analysis
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29 entries, 0 to 28
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Month     29 non-null     object
 1   Zone - A  29 non-null     int64
 2   Zone - B  29 non-null     int64
 3   Zone - C  29 non-null     int64
 4   Zone - D  29 non-null     int64
dtypes: int64(4), object(1)
memory usage: 1.3+ KB

In [24]:
data.describe()

           Zone - A      Zone - B      Zone - C      Zone - D
count  2.900000e+01  2.900000e+01  2.900000e+01  2.900000e+01
mean   1.540493e+06  1.755560e+06  1.772871e+06  1.842927e+06
std    2.619401e+05  1.683899e+05  3.331937e+05  3.750165e+05
min    1.128185e+06  1.527574e+06  1.237722e+06  1.234311e+06
25%    1.305972e+06  1.606010e+06  1.523308e+06  1.520406e+06
50%    1.534390e+06  1.740365e+06  1.767047e+06  1.854412e+06
75%    1.820196e+06  1.875658e+06  2.098463e+06  2.180416e+06
max    2.004480e+06  2.091194e+06  2.290580e+06  2.364132e+06

## 1. Mean sales generated by each zone

In [25]:
#mean sales in zone A
print('The average sales in Zone A is: ',data['Zone - A'].mean())
#mean sales in zone B
print('The average sales in Zone B is: ',data['Zone - B'].mean())
#mean sales in zone C
print('The average sales in Zone C is: ',data['Zone - C'].mean())
#mean sales in zone D
print('The average sales in Zone D is: ',data['Zone - D'].mean())

The average sales in Zone A is:  1540493.1379310344
The average sales in Zone B is:  1755559.5862068965
The average sales in Zone C is:  1772871.0344827587
The average sales in Zone D is:  1842926.7586206896

## 2. Total sales generated by all the zones for each month.

In [32]:
zones = ['Zone - A', 'Zone - B', 'Zone - C', 'Zone - D']
#including total sales column to the dataset
data['Total_Sales'] = data[zones].sum(axis=1)
#Total sales Generated by each Zone
data[['Month', 'Total_Sales']].set_index([pd.Index(range(1,30))])

         Month  Total_Sales
1    Month - 1      7022544
2    Month - 2      7152303
3    Month - 3      6475939
4    Month - 4      8174449
5    Month - 5      5995328
6    Month - 6      7151387
7    Month - 7      7287108
8    Month - 8      7816299
9    Month - 9      6703395
10  Month - 10      7128210
11  Month - 11      7032783
12  Month - 12      6111084
13  Month - 13      5925424
14  Month - 14      7155515
15  Month - 15      5934156
16  Month - 16      6506659
17  Month - 17      7149383
18  Month - 18      7083490
19  Month - 19      6971953
20  Month - 20      7124599
21  Month - 21      7389597
22  Month - 22      7560001
23  Month - 23      6687919
24  Month - 24      7784747
25  Month - 25      6095918
26  Month - 26      6512360
27  Month - 27      6267918
28  Month - 28      7470920
29  Month - 29      6772277

## 3. Checking whether all zones generate same sales amount 
    Using One-way ANOVA :
    Level of significance, alpha = 0.05
    Null Hypothesis, H0 : Same amount of sales are generated in 4 Zones.
    Alternate Hypothesis, Ha : Different amount of sales are generated in 4 Zones.

In [29]:
f_value, p_value = stats.f_oneway(data['Zone - A'], data['Zone - B'], data['Zone - C'], data['Zone - D'])
print('f value is:',f_value)
print('p value is:',p_value)

f value is: 5.672056106843581
p value is: 0.0011827601694503335

#### Summary:
    ● p Value is smaller than 0.05 (significant value)
    ● All zones doesn't generate the same amount of sales